app/Controllers/EmployeesController.php

SELECT *
FROM `employees`
---
   public function index()
    {
      $employee = new Employees();
        $data['employee_details'] = $employee->get()->getResultArray();

INSERT INTO `employees` (`emp_code`, `emp_name`, `designation`, `age`, `experience`) VALUES ('emp_020', 'tets20', 'testing', 26, 5)
---
    public function store_employee()
    {
      $form_data = $this->request->getPost();
      $employee = new Employees();
      $form_data['age'] = date_diff(date_create($form_data['age']), date_create(date('Y-m-d')))->y;
      $form_data['experience'] = date_diff(date_create($form_data['experience']), date_create(date('Y-m-d')))->y;
      // echo "<pre>";
      // print_r($form_data);
      // die();
      $employee->save($form_data);

SELECT *
FROM `employees`
---
   public function csv_index(){
      ## Fetch all records
      $users = new Employees();
      $data['employees'] = $users->findAll();